[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
457
798
66
277
140
370
190
191
2010
1019
2008
1085
379
1299
5596
2363
725
773
636
861
862
462
1150
19
800
571
533
1149
4380
23
90
295
565
807
153
941
226
812
453
32
2292
521
914
278
275
276
29
108
3292
198
1763
130
4146
1104
101
2996
11
8
9
313
102
80
177
426
133
134
1802
10
200
2229
477
358
546
1709
92
2643
540
8640
1853
4789
14625
1525
432
971
29366
208
355
5908
1247
209
246
247
2288
2169
1403
11108
16
249
39
1376
2170
328
62
12
72
99
1475
71
76
420
690
10127
58
252
63
854
52
53
106
161
254
67
1079
2627
2628
745
168
258
2456
169
11888
1811
470
455
456
146
347
176
1221
42
5084
710
711
43
11279
3150
421
20624
24
48
45
478
12289
2405
1174
1307
1213
333
185
4667
50
336
1645
281
56
381
382
5037
1431
5038
1513
392
1129
86
227
1624
2251
49
308
2191
89
988
221
433
903
264
1854
1251
342
518
602
1195
37
212
213
35
65
331
285
280
1835
288
770
3193
5368
123
13
1759
3545
415
618
1652
202
3750
440
1207
172
519
481
304
1101
1021
2585
181
6473
3318
2319
116
2934
180
222
223
3748
464
3705
1182
424
291
4
5
6
6438
925
459
217
1105
719
163
251
1758
613
592
671
4622
1534
253
243
561
239
232
230
81
1688
788
1188
3074
128
2909
473
784
1536
935
282
283
3217
661
1277
46
47
334
1116
1121
1053
757
3
5673
5674
672
77
590
300
1290
5209
643
18
1024
512
1478
536
4426
444
2743
5981
785
548
4108
4992
5642
29925
365
131
135
136
1656
744
1276
829
830
14410
1894
1275
831
187
79
28
229
634
1868
4160
299
790
1006
2930
126
593
162
416
2770
16472
574
93
4269
2192
91
8107
524
525
1985
263
739
2606
2595
709
476
692
431
693
4410
196
551
118
338
1113
6192
1198
417
332
396
1041
1795
474
475
5025
1205
1211
1209
1210
1206
1208
6348
3361
6349
882
6521
4838
1201
9846
14407
14408
9440
652
535
1769
1770
485
4458
2725
1193
599
600
361
2776
44
2283
3248
819
1640
1509
1934
1615
4262
1361
307
192
465
394
395
3360
466
794
647
350
238
3162
740
2672
2673
240
2205
850
3661
360
682
883
2731
629
705
511
7007
4710
1354
2029
248
1319
836
447
74
1899
3502
344
114
810
173
311
573
1655
1178
880
384
14
220
354
189
224
87
1310
1311
8130
909
12067
945
107
1316
750
12677
468
578
1443
158
55
25
141
1286
1526
9583
1190
1289
122
837
423
4314
11557
250
6172
454
741
3917
3918
461
94
292
3678
922
761
2030
1124
3604
1333
813
9747
14498
3776
3254
3617
471
1338
1339
1340
684
1801
3139
317
113
679
117
1228
1229
119
1636
82
1592
2448
1907
380
267
142
2612
1576
451
5652
1644
1379
326
1635
591
6798
2764
270
271
4169
1222
1223
265
3044
3045
4468
2316
1804
2074
2075
10957
899
965
2034
15012
8116
242
410
933
1470
397
6014
3610
1596
877
878
312
842
4592
1694
1249
1110
2882
1902
3215
1661
3367
6860
127
554
59
10056
8605
472
852
3041
1556
818
2358
955
3667
2962
724
15
2162
676
11027
828
767
6604
1233
3923
1023
3964
103
1080
3883
12469
12634
2601
4610
960
2463
2853
1501
2854
962
802
1035
824
434
1739
1401
1548
897
3034
916
405
1002
64
262
522
2832
33
1135
1600
4211
1163
1461
2706
390
534
3081
68
69
70
369
13148
5066
887
5931
149
5928
6273
646
1387
1650
2597
1653
5344
611
3331
236
237
1162
1025
840
1164
3285
2082
159
538
623
678
499
1017
2077
764
2269
17627
1057
1618
615
1359
1014
832
1
2
7
16166
8592
559
560
612
95
1495
1425
4781
3920
1847
341
2209
413
1786
1381
2320
632
729
3714
1829
2061
804
6370
2343
642
7061
1724
120
4058
1642
1405
1712
665
9412
6157
1545
1180
12670
279
366
4740
3186
272
1632
1367
1368
1063
1369
1542
348
2575
15505
1325
255
606
552
553
2471
1609
10942
550
2053
762
4984
215
1990
2663
8940
500
1184
1287
4524
3535
3672
809
371
3536
274
3543
5977
1377
653
572
6806
723
1013
6455
5971
1911
2027
934
986
2768
1904
1522
11004
4089
1133
594
4775
449
422
691
287
7043
329
330
881
3229
484
1479
3489
753
1493
2246
4580
1173
1675
137
6792
8835
115
349
1008
8333
754
771
335
2641
231
1555
1322
662
83
13789
11129
864
595
11788
1698
1087
970
1235
147
121
3089
5345
479
1617
482
483
6435
1574
1667
175
7660
1242
4007
10867
97
990
781
782
2513
8137
495
626
5198
373
1068
1106
17662
689
4324
1259
439
4012
1719
2460
669
10045
2478
940
2873
1097
1231
178
1095
989
4204
389
1946
2813
18198
718
1183
12701
4033
2334
4097
8045
2002
3764
148
808
41
1497
2038
806
904
266
520
5257
4552
1115
2432
1004
3778
687
5757
530
531
4110
3434
2765
2419
2613
14348
851
644
7554
3151
7647
2037
527
315
526
7211
1091
5395
5763
4494
1092
11886
2615
1329
1394
5059
3273
776
1042
296
6069
532
241
14667
1715
3287
1267
2825
12998
1453
228
1134
1593
4682
353
1130
1054
2710
894
193
2208
1168
302
875
3974
3378
2732
670
998
12425
2670
2630
3175
1352
1487
1716
1141
675
2639
1263
811
6055
7690
7691
3087
8441
4806
9590
1227
3548
856
3300
73
3492
3141
1236
1032
286
14748
428
4795
1582
406
586
318
2158
20
3268
3269
3270
3271
3427
4834
6405
964
3070
3515
1781
698
3332
2090
2675
1278
442
844
13319
8609
419
2107
2108
186
1660
2830
188
54
10792
4224
2340
4523
23240
3075
12530
657
3094
2409
1089
437
2687
6638
1282
9801
2006
345
1974
3919
635
38
2567
2568
3982
641
157
6378
446
3577
1100
3224
855
734
1022
1756
1460
36
398
1154
10366
508
707
979
30053
4061
1549
1136
956
3093
60
2056
885
799
10592
5401
8846
3936
795
1440
1050
403
2175
1107
1584
11301
588
1787
991
1230
1998
1723
1402
448
1729
261
749
825
5477
1943
110
1317
3751
9507
17601
7674
3302
443
3824
1059
2223
12952
4801
57
1424
1476
10214
1745
1389
10333
1203
1396
11388
1001
949
1814
541
1979
5450
1651
2538
322
1048
2306
547
4282
469
2868
1266
1496
2007
1347
603
1448
1449
10546
1613
5436
7236
374
1450
3625
3322
726
2472
6936
2260
233
1499
9834
579
4236
1268
954
873
309
124
1915
4858
5475
5479
1647
3927
651
24431
7466
314
4419
6362
2280
6363
6364
3359
2076
2549
847
980
6969
2530
1370
2351
290
683
3960
436
367
8865
26109
1170
1680
1760
5896
708
4968
3803
12085
109
1142
1570
1701
6379
9790
7311
205
1803
2622
3474
2271
2864
352
1873
25333
1503
493
9339
1465
1463
4003
1489
12258
427
11956
2394
3444
2214
2688
5445
3296
5138
1562
7522
25918
2256
760
378
10984
2804
2570
2805
889
1153
1353
814
815
4697
2504
7475
736
1378
1337
9033
7917
5985
3052
3024
507
1683
2213
787
2197
796
31
34
1747
5889
4808
5183
1070
2626
919
1860
1588
3406
13446
368
166
260
75
1139
1012
4223
24275
3971
928
2679
699
1722
1872
938
853
4416
4503
324
1009
4207
6412
5168
2609
1192
3470
3882
2820
3381
2415
2023
11734
1386
4649
969
17653
3138
849
12225
1682
1331
503
10009
876
1918
1003
9263
22
3161
1088
543
2454
959
4313
2210
863
1693
7541
494
1543
2789
98
3043
1430
2560
583
3620
1239
2142
1185
1186
2261
40
1411
1820
3316
17118
12127
1038
1417
372
3450
1704
1335
10391
2176
11958
7403
1226
1342
1346
3871
947
5378
1851
1395
1702
4517
9941
608
2342
5966
1603
566
1581
7543
15207
14434
14524
486
489
1473
3026
10216
981
1491
1517
2126
575
12769
715
2042
6646
7588
6021
6022
2244
6667
3253
3966
2423
211
1793
362
3343
2889
3494
752
3761
1728
4638
2091
2092
948
4520
2148
2912
1446
984
5242
1326
884
14504
20788
5553
12629
293
294
171
2828
2692
297
458
1732
14668
5090
17588
6004
649
650
1382
3315
337
4613
2678
3116
3897
2366
1877
6821
298
5070
2824
5071
1049
1999
2000
1125
11970
2235
1373
1374
4305
610
376
17645
614
25281
1438
506
6633
1648
7409
14519
1294
805
4644
16638
5119
6224
1510
16587
1919
915
1780
6869
975
972
973
1037
3682
3985
1800
1295
9353
664
944
1421
2540
3498
2361
4201
8965
3832
1052
4428
3614
4641
1560
917
918
1619
1654
8763
11992
3119
6563
3969
906
1816
6440
1304
319
10386
1034
435
4092
942
460
2871
25399
3583
568
1094
2124
958
3276
1445
8741
890
895
11226
11227
2154
1364
1366
138
8179
132
1391
10929
1874
514
920
921
542
5449
3648
1849
1705
3760
11412
15490
2066
2067
2418
1734
4350
418
4759
7451
1498
1622
5069
680
2115
9822
174
1527
9211
22507
5203
2281
1798
501
2642
3210
16598
7631
4356
2487
14972
4736
11552
1773
766
860
14353
5034
3062
1929
18840
23766
2536
23767
7771
3368
14124
2534
20683
3154
2521
78
640
16565
1350
8092
164
913
3877
2134
3192
6019
15739
4214
2098
31537
5872
3299
1699
4231
14417
1610
1864
645
2250
145
2483
4657
1292
2014
1296
18629
3931
5096
1466
2557
5653
3747
966
12260
1993
1280
562
1951
6883
2906
9458
3724
7517
6237
1931
1332
441
1027
4823
8164
4355
3675
17420
16510
2041
1687
2398
7113
2580
1047
6644
12824
4538
4068
2434
8902
3099
1544
3225
467
2807
4415
4570
817
5531
8430
1225
786
1881
1108
598
9785
5415
1684
3758
5991
1569
17
1625
1507
12033
4053
3385
4240
1789
3452
783
3402
3220
1523
1305
3765
289
2444
7095
5577
1537
4137
9410
8456
1238
197
4890
545
2645
2646
6268
732
1839
6926
6360
4471
5083
4704
340
841
2488
402
24705
1547
1765
8216
2109
792
4119
5540
513
450
2656
438
425
704
7388
1692
5516
4955
6291
4537
2870
3168
3649
6293
7489
3652
1666
1939
3537
218
219
216
10415
706
7924
8555
1512
6916
926
2370
3795
3796
3669
5442
375
4344
963
19051
1166
6735
6736
2780
1626
5498
6381
6382
3887
16146
2227
1452
21984
2501
3243
3355
7667
1567
8382
5359
6141
867
777
2245
5074
4510
3643
23156
6468
3342
4737
3170
3512
2816
4787
15046
1504
4187
16687
888
27351
16688
2412
15060
8394
6734
256
7719
1982
1467
1365
12274
9175
4866
3327
4159
7470
7752
310
2693
4831
23273
727
225
627
2604
4535
12061
8244
1323
1324
359
1420
1051
6467
2990
8145
1220
10620
2289
2392
5200
3838
7462
4615
4931
4663
9885
5980
2013
6952
4621
5747
3804
2782
2784
7725
609
2800
156
3641
2684
2389
1637
13773
2611
2174
17569
7381
1018
1958
2272
3828
1920
5086
96
3425
8400
155
5472
1994
1706
16225
5137
5340
1269
2173
722
7358
1583
4186
11242
11243
12222
9964
2772
1954
3529
301
567
11568
1414
886
2857
4501
1212
13202
5194
858
859
3676
2135
28456
4074
3815
4761
7267
5384
2138
1315
1568
2177
838
2860
2505
13793
8854
14502
1794
3582
4358
1007
2204
3221
6552
2146
11533
6506
8952
12831
505
1532
2954
8734
9637
7520
6809
2746
1137
751
20590
1880
3662
589
3822
1160
3757
2421
5300
2290
4188
5036
5210
463
502
15198
5612
1255
23183
5232
2600
7169
4986
999
2856
620
1928
5910
2286
5550
2285
1271
13463
5692
10385
8590
2152
9787
2936
8958
2241
5285
10885
7496
2849
1397
5406
7569
3358
2975
1833
144
15550
12895
5965
3797
3798
18058
105
4804
11537
7443
3736
4749
10596
179
1967
5629
1176
2407
4915
1696
4909
1252
6082
9015
22131
5988
269
1330
1328
8903
779
3639
1944
4929
951
2497
6999
2836
3659
5469
5470
14268
2616
1128
21
4143
1987
15010
5590
5591
8128
5460
14978
7001
7002
1665
5110
18266
6910
23582
4880
24718
6387
9457
6377
3209
13444
1748
6315
3079
3478
1559
6953
3567
9289
7354
1906
2976
1970
393
1914
13493
6261
1200
3885
19733
24266
7285
823
1314
3458
15676
4828
15707
4963
4728
15717
15993
23952
2657
2658
5922
4216
772
582
3962
7652
7511
24749
1916
15889
13373
2149
2747
13763
13764
3653
866
4478
3846
5318
1484
1995
6855
3317
10650
721
2777
3441
11082
1055
1011
6002
937
4047
2420
16647
2831
3117
6647
1731
1681
8429
624
625
3763
2496
1349
14374
2327
7697
160
5052
8124
1996
1962
1194
10014
3925
24368
7055
24369
3015
5346
1197
4511
4993
2698
20714
3433
15275
1412
2541
2775
1753
3451
11657
1061
967
1741
2574
4409
5250
29607
17901
3247
2636
2846
1300
4219
2122
939
3612
2961
872
1426
1284
997
6937
13423
6081
10911
12282
3856
8561
4758
11880
4602
9674
23834
15683
1808
4044
996
10242
2305
4467
2965
13326
6336
1514
1515
2044
1274
1264
6437
3576
5853
9961
6024
12732
738
12131
13453
15131
2113
1812
16730
1817
11804
6073
6450
5882
4883
2989
2527
12148
14177
3483
576
1639
5624
20157
3284
3993
10318
2436
5832
2369
3293
539
5237
674
5255
28013
357
3025
5884
1858
8131
2059
7998
21333
2166
3949
3902
5441
4163
15541
3519
4981
6037
5330
2307
911
3005
4940
3306
11366
4987
5249
1345
1643
3118
4640
4878
11182
6402
10077
10079
6887
4919
1662
2216
1842
13205
2590
5718
5417
5016
429
1948
1903
24380
4055
2172
6343
6337
2198
4327
104
3228
408
235
25564
1506
26496
7768
4773
1664
2111
6783
3951
7515
14403
2230
15029
857
23438
1870
2101
2867
2992
339
581
5238
8473
2531
194
1187
3435
6115
6116
10749
601
10716
24201
1343
11253
2818
758
2155
2156
4660
5047
7519
2647
10512
6384
2773
1158
12544
2190
3096
13199
2520
20690
2799
9951
9643
961
14671
1530
797
8335
2736
9485
2455
3377
6271
3272
4460
17359
8384
11968
5325
1672
1790
1072
6411
14696
14697
12316
2583
1774
1685
1649
2301
4792
4793
5197
848
4800
2469
17994
5179
633
1575
2160
1103
23308
1500
2629
17045
8679
907
5023
3357
6962
6149
1488
24188
4932
7575
9748
2594
1597
214
2125
151
1935
4485
6459
6740
4010
22608
17631
2402
3308
7657
1638
29768
18949
13726
2060
3562
6472
9673
2735
5987
4762
517
17268
3405
2876
5178
3181
11160
2046
2047
22801
2025
1216
1490
11325
12807
13911
1383
2094
6642
2401
826
2904
2019
3655
20787
8292
14753
5120
6332
9196
4330
23853
4600
3738
5354
2136
3888
3440
3126
3027
648
2700
1360
22411
10795
2866
1145
6711
356
2181
580
3160
7538
5433
2017
2298
1288
17666
1462
3755
327
775
1925
1945
452
3632
316
321
6845
6846
27785
13705
7406
5808
1959
4203
976
5544
5665
1456
100
8393
10438
6578
8100
7840
3004
6162
1454
1058
5452
3059
3129
4046
9848
4456
3775
12362
5505
5506
11143
4832
2785
1646
3514
5149
8885
14216
7499
8425
1237
8573
2022
4857
8485
4136
10630
1253
4962
1272
1302
1949
2221
4848
2686
1196
18966
3345
6896
3465
4936
3078
1518
154
2631
9292
4867
16265
4868
18412
14850
2625
1553
23774
3503
1878
5976
2753
3071
4175
7619
1551
2885
1321
9682
2869
619
4261
871
6340
3844
12744
12745
12746
694
8077
1546
2667
7369
1189
6992
10876
5360
26042
1932
10624
3859
1118
10607
5323
22797
1336
2973
6259
3701
12063
12203
1245
5026
4974
4975
27063
6030
2655
5847
14784
968
3100
6231
5334
7649
6623
9904
2437
3135
2532
2243
2892
3362
5518
10332
24034
4081
10048
10187
12477
1529
400
1046
1871
7030
7121
5934
5698
2240
3559
6408
4565
2842
2562
2381
3713
16270
6461
5948
2676
822
1415
4607
4440
1856
3976
15311
4106
1862
3013
4134
4011
7682
4650
16290
6838
6839
8476
2806
2461
1955
2315
5695
13889
4864
4590
18396
510
13894
8013
8014
5355
4942
4732
13741
3171
622
13334
1036
4249
6009
4025
3895
681
2354
11023
5456
26281
17750
1096
1244
11399
16998
4153
5502
2311
9334
19208
21677
2374
2464
9310
1243
28264
1219
1045
11580
584
2495
4342
13707
6118
4979
929
4694
5510
7799
993
10526
28568
2143
2144
2356
17516
2940
7604
2116
977
7931
4004
7042
1671
2470
26947
7950
2393
7721
6109
10436
7738
3424
1866
2508
1913
16915
1883
3022
1697
528
13131
5403
4656
2449
4361
9475
1978
6843
25745
2130
2073
2129
129
8098
6356
952
2879
17135
1976
8201
1730
13350
3873
6967
22896
4964
4675
4289
2080
10148
13372
2199
3123
6858
9223
23649
3898
4814
4078
2299
2988
10821
7039
3929
6754
2222
9032
7106
2945
6006
2944
4149
5555
2724
7579
9046
7086
2349
21672
4420
4681
5293
2561
3202
3257
3978
2576
3563
25178
821
742
7114
9421
1623
3987
2089
2555
14822
10422
12601
879
529
8671
8672
6598
6597
14928
3032
3082
4130
6299
414
1157
3729
15278
18437
11394
2786
11673
3848
3849
3850
4070
2937
2938
13918
27894
2596
17902
22137
19083
4855
4856
655
268
412
5974
13645
9614
3374
5900
1358
1132
8245
4183
2947
5496
10255
10397
2201
1472
11274
1620
5439
6454
2105
2300
1109
2476
6955
4495
728
6319
13696
9945
2475
3289
1963
3149
12301
2572
2801
7823
11541
1528
12178
7432
8256
7993
2051
587
11594
5222
1363
2995
7974
7975
839
4464
3930
1075
5147
14463
3588
5804
3264
3314
9940
5171
20694
2106
3674
6053
3047
9780
21965
702
13167
2102
4091
2833
2835
85
10728
7104
4026
4027
5307
22084
30
13355
1384
4766
11163
11272
3007
11323
11324
3770
6656
9106
6092
4278
3479
9832
22865
1791
5830
2347
4711
9776
13343
4308
2377
6120
10861
24967
4958
18121
8121
8122
1459
5573
6825
3940
898
1796
6124
1016
9318
6431
9319
3242
2662
1181
3183
8009
2715
2386
8934
2918
11632
7518
5268
11934
11048
21666
4625
12238
5324
6308
3805
2774
1897
5967
4727
3950
3180
2718
3670
4206
2651
1404
13746
5145
1972
15593
5508
1857
165
15128
10878
4884
7577
10983
2011
2526
399
5361
4643
4331
4557
5341
1825
411
487
488
5176
13274
2621
4891
1159
11260
16589
1177
377
10344
1658
16530
10017
1390
2328
1147
17619
2202
7772
1668
1254
6731
5713
2490
19330
2357
6820
11434
2991
3065
13618
4709
7739
10461
386
10462
6471
11984
3204
4596
5105
3826
3955
2760
234
4593
8199
4902
12693
6100
8277
7767
14718
9597
5132
2267
1293
7724
4876
18685
12735
2085
6958
6788
2304
3080
12638
1224
14514
4672
2671
2695
5785
3329
2573
1927
5964
5218
2838
5295
5707
2581
1146
4933
88
2707
7723
9058
3935
5600
759
10331
6033
6706
6519
2535
18144
4633
4418
10241
5299
19117
10966
15494
12347
4021
2759
12851
22547
5777
10945
4549
563
564
6724
2045
1884
1885
12044
8670
1256
2819
7256
17235
24896
13767
1762
927
3893
13342
8149
491
3260
23332
18782
6799
6800
6801
6802
2502
24259
667
1605
5231
835
15138
7235
16329
7307
1283
16465
7683
3943
995
6683
11739
2787
2084
1270
789
10319
3970
5946
5396
14140
23884
5772
1788
2728
1754
2949
9016
5201
25405
15253
5930
2117
203
204
5949
2845
11967
12753
3860
1540
2330
3277
3961
12907
10303
10835
1260
1422
3814
3304
2302
720
2872
2489
5608
7427
7428
3364
9325
2704
3954
1905
5219
6635
4172
5667
25598
2164
6722
953
896
2408
2533
1468
2858
2859
7783
23742
4230
10865
6306
7215
5313
15921
14152
8480
12773
5716
11555
13758
3201
6288
8461
14635
5628
10531
13193
6163
1718
4145
13368
17382
17576
2757
1711
3551
7550
14641
2375
3726
8197
9172
5708
2064
1805
9695
170
2093
4237
5058
4403
4338
16108
1819
2987
10362
22950
8146
8114
21146
4803
4611
7382
4805
17936
6782
1714
5765
13440
8484
2608
1202
8203
9911
6643
19715
4020
3525
1933
3613
4693
2796
2368
3466
3467
8012
630
1240
2323
13970
7038
2491
2482
22456
3083
19457
16659
3418
8463
2681
2680
10579
3251
3384
4382
3716
2165
18864
5227
2791
13967
13968
5752
5050
943
1940
6344
6227
6281
2883
10764
3906
2908
16071
6304
10935
12931
10371
9514
10219
2120
2429
8788
9728
8436
6625
12893
2462
6474
8991
930
931
569
6853
22309
6824
4028
3520
7146
1175
673
1947
7380
3376
8324
9895
6709
2035
2477
2823
2232
6823
1451
677
8656
2079
4273
5042
12788
1508
5940
2355
4676
1960
15241
4475
4476
4002
12413
8754
3891
7112
2380
28288
6007
9824
9825
12714
4360
12527
3544
2400
15656
7665
1834
3431
2617
1900
16325
3894
30327
992
5532
2003
4454
3816
6260
3718
6976
3499
537
6003
1981
2336
1102
4345
24973
27765
27766
8022
3834
19699
5959
4578
14746
18520
2865
3371
1909
3994
1320
9607
12074
10782
2546
5766
7748
13380
16152
2598
15330
13345
13136
7424
8227
6298
11627
22153
11534
4220
10645
3351
259
11001
3305
15485
3382
4705
6170
14812
7136
5567
2458
4437
2403
5193
3505
685
923
791
3817
2433
7201
7202
8138
16650
8993
8750
5474
26615
9049
5693
9026
2548
26324
15899
4572
18378
2577
2745
5158
2697
11663
8150
3403
4079
8525
7866
17881
2427
3524
3526
14180
2309
2254
13908
6517
3603
13294
4994
3741
4063
10074
10038
4790
4791
5984
2009
15141
2999
2798
4099
1669
2121
8322
11832
509
8490
1265
2539
4473
4661
1832
912
1248
10952
4718
1123
9768
10949
2182
16025
10357
5013
27
4111
6016
497
1119
957
6737
2702
3010
4391
5254
9989
4141
2065
5312
4628
4301
3290
13878
7585
8177
8175
8176
2591
5468
4234
2411
3105
1971
9424
7546
13327
12023
11508
11613
3036
28016
3830
2282
3657
4620
2839
4726
631
7035
4405
3957
4859
1573
6292
7892
6961
8420
2682
8298
21441
6569
2547
4275
13044
10000
7444
5572
9215
4155
3991
13974
5625
985
6423
8313
7757
2984
15901
13555
10527
14104
2234
6132
10537
4164
5571
16460
5033
7871
3155
1657
7150
10659
1888
833
3484
4247
15822
3638
4292
4893
2447
6652
2762
5731
5221
10635
3916
6399
5457
5671
8708
5809
9171
5995
22478
1355
2039
4496
7956
5267
8304
6129
6301
868
5453
5720
5799
25947
8196
14912
8039
3009
4135
3890
5890
7345
3790
3690
13141
2742
6106
10999
150
2652
6636
6613
11059
18090
28210
6253
2303
2664
5684
13002
12518
4977
14237
9014
18684
3800
1039
8789
8075
13946
7670
9268
12192
26149
6242
9626
2414
20118
558
3363
6089
2610
5780
1471
1469
3722
7923
2542
19099
112
2452
9935
24348
6547
17372
24349
3060
3061
24301
3437
6886
2769
2779
7006
25510
4178
16099
4271
4560
7947
3973
5270
4369
3313
1114
3278
12472
21714
21715
4288
1594
21762
4835
7359
1564
12224
9494
23752
6122
4337
1844
3203
3176
4624
17671
11356
19882
12151
3584
3585
15258
10049
1144
12569
1822
14976
730
9564
4673
4886
4923
13743
16723
9692
5911
3581
5850
5101
8492
18749
2005
4928
5691
4374
4148
12609
2333
13697
26716
9108
3014
9697
6787
3813
2054
4122
11172
2284
10019
523
14244
6765
6616
1031
27553
3782
3375
3143
24463
2920
14175
11625
5481
1776
2878
9303
7258
6772
27495
7574
8588
3173
8215
14647
10730
16051
16047
3766
6608
7418
3120
3541
9419
3390
27548
4455
5742
1455
11084
7218
20528
1585
18600
6663
2691
5774
6174
12782
7205
7398
18788
10290
7065
5225
6067
9027
4642
5448
2376
9307
1676
15503
1757
2607
10950
5787
6489
6832
4299
9304
9121
4050
1485
2614
12256
1966
2618
12497
9454
6119
22321
8580
22322
12585
1043
4417
2550
11831
2739
3019
12973
7553
16533
2891
351
555
6902
1628
13806
8793
4447
2071
12674
5605
8509
7440
4052
5278
8132
5443
8040
4144
3827
2877
18818
11669
15123
10817
10478
11099
12118
9994
6177
1792
4109
17883
17444
8738
12114
15375
11490
845
846
12411
5247
2178
3407
3447
11348
4648
5311
21096
12798
6103
9274
9462
9463
12811
1074
5336
7099
9921
3735
16831
7159
7115
3475
6903
5264
22107
14862
17696
24684
893
3783
2834
5536
14577
4000
1464
13932
6620
12565
2644
3809
2810
10299
17126
9314
737
1876
4815
7330
5493
1710
7178
17684
2797
3785
139
9060
6107
4335
11527
6933
7671
16676
6755
13269
5121
9629
4241
18078
1362
2974
4421
7089
3125
6580
1901
8036
11597
1815
5762
5055
6110
1535
4031
7286
4849
9943
6550
3092
11053
11054
4085
7681
13535
1117
1111
9213
7259
9865
2893
6901
4528
3410
383
7936
15237
19196
498
7193
19429
4229
6465
9331
7220
9266
16557
1633
182
870
5253
8575
6828
3131
13548
4783
4567
6355
4083
12752
4098
26513
1572
2565
2566
3068
2114
7197
5839
4325
1442
14215
6776
13899
4666
6715
14777
5651
5260
4965
6245
874
9664
7077
11194
5259
6052
8744
24606
24607
480
7639
7173
10239
6771
2128
2529
3152
5122
2348
16782
26580
5770
4032
4536
16259
10152
2139
4579
8142
6727
6779
8896
12697
18950
3050
6482
19145
1924
8888
7951
16721
6040
6269
6696
14877
17854
17331
13593
3737
1436
7393
15053
5961
10321
3250
5095
10989
3719
4630
4372
10396
1408
3611
2226
10694
22468
17169
6977
3055
6978
8985
803
9136
24359
24203
9135
24204
3706
2353
12920
1138
5243
14732
2901
2332
12412
8759
11280
23319
3158
21939
3896
6256
3463
7715
11472
3387
9426
2766
7973
4252
4037
9830
15019
4208
3693
12253
4917
1482
24146
24506
24507
26423
4117
23069
5865
21047
3252
663
14450
5855
18872
2273
16509
29414
23898
3095
2599
7615
10706
13518
3340
3702
13849
10727
11361
13860
13769
5463
5702
7593
2896
14290
4861
5937
4034
1566
1563
13821
4304
3835
2099
7984
6990
9618
1516
22118
9771
4937
1953
24253
7986
22255
10922
3708
9826
2001
10557
5142
6297
7248
11875
2524
3321
27853
22937
7171
1093
11556
24413
7989
16555
7484
7254
1098
2778
2511
13224
8486
5986
7276
9857
20463
9214
3256
1434
3182
11239
8918
4715
14378
12595
1400
323
320
2151
12715
15352
10611
10997
7611
7017
16729
1120
22783
11119
5700
2040
2187
13498
11688
6094
9483
5397
12972
10853
7412
7413
7754
18327
5093
22690
11062
4874
3021
4191
9145
10941
8071
23819
1474
1309
11131
12172
7930
1840
6834
14737
3016
7198
9050
4647
16245
4452
2633
7825
15655
2840
4060
16402
13563
1752
18981
9990
10895
11333
10419
5124
2410
3727
1926
11208
2744
28334
12584
2119
2479
16907
1602
8856
4268
7282
11022
8796
2390
4551
5654
5655
2926
22877
6267
13557
11891
1561
27008
5135
4302
6277
11510
29971
25308
10078
7337
5958
6544
24479
5088
15867
2441
1126
5467
3112
12291
2422
9886
17975
2738
17318
5103
5081
3369
12980
2795
5365
7764
6906
13779
22369
8930
5385
5240
3749
11089
4251
4267
12381
16878
5499
9778
4197
1416
4774
2217
23367
6703
5883
3232
3373
11094
7094
5342
7857
2705
10660
3516
5473
7250
16564
5230
8889
901
7468
3922
4634
4635
5471
3319
7253
7880
15217
10667
11179
11213
25290
2396
3462
14338
6137
6138
7818
6847
9754
2397
14261
3959
3018
21281
9235
9236
23669
6153
3159
5877
12741
6389
2640
1334
13482
11740
19487
1077
2163
13895
596
597
2886
13185
2569
3211
8920
19969
5557
17325
17326
6211
10139
5294
3886
3565
2905
3679
10674
6112
3924
6329
8477
8742
7116
9761
11118
5382
8532
10068
20174
6741
14646
5522
22290
3715
1407
1398
5024
7793
8346
6913
1151
8753
1923
11271
11576
24935
3837
16925
7210
4088
4296
4297
4298
3616
5637
1521
2994
4166
14345
9624
1447
2150
5528
2255
8386
18270
12093
8295
5167
18914
14310
14344
5125
5726
4385
4386
4387
5173
14230
8999
5668
9799
1824
11440
11441
8864
3900
1965
7558
4226
616
23939
780
4743
6669
3819
7877
22346
8842
15331
5564
18117
8048
12124
8464
17253
8860
8861
8862
3663
17302
27768
1156
3734
9111
2719
10072
10004
2069
2435
1890
6549
4853
15489
10245
9115
10211
9573
14143
6079
13890
8622
5562
17725
2153
4907
2803
5545
4215
1520
14058
10996
14123
14482
6488
7241
4569
8381
1578
8695
5358
17213
23464
16770
3589
3568
11793
5626
10377
7842
5615
639
3481
21975
10854
9417
20642
11231
13581
7776
3432
12902
17821
6203
3965
7766
2979
11991
1086
4154
306
5619
946
11485
9157
9158
8641
27407
712
4162
9819
14311
11176
9283
3558
2714
6640
6641
4497
10890
401
6477
5992
7272
6511
3510
10190
7021
7022
3754
7371
9200
3892
11915
18276
14596
7773
7590
4894
8443
8101
8682
14167
3552
6900
9416
2690
793
12402
6441
7033
6763
11137
3003
8510
4093
22571
9708
6512
5283
7183
6418
4741
9401
8806
3459
8967
2659
11180
7128
1938
8988
14849
2308
2137
7118
1505
5372
6017
9034
4124
10302
3195
5609
22631
6796
10081
10468
4321
7566
16692
10689
15314
3820
2957
24335
11282
1554
2481
2727
16100
11096
621
7654
2720
6966
7332
2055
4171
2578
3988
6011
9340
26572
1612
17735
17736
17734
7991
4568
3564
13076
11813
11071
4326
4019
2473
5957
9767
1428
1777
9482
8003
7404
3338
2826
3733
10773
4087
3608
3446
3723
869
3740
5846
2445
5128
3637
14825
1895
17344
8723
10231
4636
10928
7351
9284
11219
15417
12271
14457
3177
4039
28590
14242
3066
16708
22200
5800
1725
10154
11686
10629
4746
17551
6479
1437
22366
2185
2814
17933
24124
18723
4114
3172
3420
1686
4080
10208
23802
10980
3806
10831
5761
1950
13089
5386
2200
4531
8810
15216
5563
6446
16698
9974
2726
735
17940
24250
8312
4665
4950
1029
4595
2346
18900
7054
8688
28428
18824
17680
6877
9104
12659
7346
9603
6442
2928
10207
1852
13815
2417
10189
2881
11562
4319
5806
6393
5824
12276
4227
1896
14169
23949
29288
24806
2268
31381
31382
6432
31384
31385
20950
2821
2467
8117
2969
16881
1867
3237
10133
4983
5297
19927
8966
6191
21740
10265
9129
11639
11640
1312
2855
13634
5775
12870
6035
1533
9599
6540
6148
3829
21967
6827
18257
8928
9152
8646
9669
5245
7774
23215
11655
20636
5672
9546
26856
22195
3909
4448
19791
12066
12106
7949
9080
3136
2522
8217
5434
8921
6686
1703
10124
18091
8839
9920
16906
14574
7805
9133
13613
7603
9225
22444
2921
6911
1969
11177
7431
1659
13323
15596
3421
3578
5878
4246
16363
28855
10345
5430
6039
12089
6434
13371
17024
4598
1766
5892
7567
3946
2179
12076
1140
7041
10213
16695
22435
15575
1634
6927
2018
5978
4731
4842
2946
15415
16345
1720
9555
9554
7320
5053
9798
1257
4629
8871
10888
15562
9517
18487
8615
7870
9224
4930
12577
28041
2841
15334
6545
8259
4927
3037
6617
12296
12297
686
9534
11519
6063
5281
5195
2507
9064
6439
26920
11370
15704
22415
18985
5140
1735
199
15370
2558
17522
15171
577
111
6764
13515
1775
7552
24866
7445
6160
3104
7833
2952
557
18041
6535
5936
1308
10601
5915
11097
7627
2863
21505
3644
1161
16338
16656
11814
7911
1586
2685
9358
9359
2919
9850
5511
5117
14050
7370
3555
3553
3554
1081
28818
1084
1577
9965
19259
9881
7274
3989
22487
3878
16321
2661
3346
273
5174
1241
6681
4910
2295
3645
2902
11008
3879
6220
5776
5116
14848
12678
654
4232
11314
5423
4846
2554
3658
19016
2754
2755
6287
4015
14935
4307
10013
10800
7926
7982
1148
24871
5339
3350
5849
5099
2589
9288
4295
26769
1388
4469
5466
8489
2193
12292
6805
26781
18998
4899
7780
3677
14415
14503
6690
15646
18114
11662
8875
2808
18612
2985
11939
13262
8674
19386
2194
7620
3056
1678
5669
10851
7902
7851
6181
7852
7854
9981
30394
2095
6884
6086
5408
21408
6971
7867
25674
6320
14710
15492
7945
5486
6891
3341
14279
14750
3635
5143
2317
20108
4113
14015
14241
10232
12669
6101
617
10771
6456
4967
5604
1060
3956
4173
7491
16231
2602
3666
7328
17422
28342
8074
22627
17231
13590
5627
7679
6615
11591
11267
8960
4291
3460
6294
604
5184
11259
6475
15268
5393
9094
12442
11229
9532
3144
14741
1799
2584
2215
9969
14684
17523
29777
1306
17351
16298
2556
4317
12135
2425
13833
1726
6634
12251
9237
4553
14632
13362
5432
6397
5639
7495
25469
4763
7070
206
201
9999
8051
17629
4057
15484
20364
688
8494
18511
3533
17383
18337
2850
4513
4585
9810
13733
17208
17029
7322
22475
15440
9847
8863
4854
7154
7234
3939
9926
504
10608
14112
11727
3869
12847
7858
14486
4599
7190
11523
6501
6738
6739
3905
15220
3188
5412
19536
9273
11236
11798
8805
8769
8052
18669
7394
3086
1040
2459
10986
10987
16560
21915
2399
9931
11365
26351
4852
14265
14266
10508
6184
16641
9619
23201
15734
11509
12591
10752
8876
6091
8732
4566
7449
2020
19209
9176
5080
15757
7338
816
12618
5710
5566
6921
3320
2247
3196
4586
7628
25828
3831
10110
4879
1785
6380
15064
7209
3398
3780
7153
10227
7000
2950
5758
24473
13855
11010
8417
6350
9056
1599
7946
5459
12857
11102
15806
18957
5969
1078
10433
26280
12312
15273
1557
7695
10863
7059
14423
13896
9077
9443
22453
16386
8344
7243
4546
23548
7587
4946
27606
4445
22408
5823
29769
1997
15985
5166
8200
1744
2188
16006
1749
5527
26169
4408
5207
8318
5048
5738
12836
8465
2338
2660
17771
16266
9505
13883
17892
4785
4167
5409
2424
4413
12813
5712
3743
11629
5097
10197
7130
7531
13579
10776
8851
3422
8550
6254
7278
5513
7108
16941
24930
25800
7686
18922
6196
3937
6818
1764
17519
9127
13173
13174
10029
10028
11865
7100
905
4359
2224
12327
8680
4953
26883
9986
17768
12097
4253
15671
12861
8281
4438
3997
8824
6222
22610
17828
2941
11101
6161
19744
5818
6313
15116
17196
25160
14541
284
5666
29428
8181
4632
5464
8607
7129
24599
11470
8647
9161
3787
26
8576
15859
7790
11623
16380
8360
7306
2257
11775
7400
2543
6151
5277
14920
6595
2737
12802
5064
5087
8431
10845
4961
8676
18206
16094
27957
8797
14448
16284
7614
9101
4218
16026
16027
15563
5089
25055
2931
14921
14922
9634
16032
21871
9252
4100
7625
10308
29745
23483
30132
6568
6989
6997
4780
4574
2998
24244
23097
7004
15038
1887
6691
23125
16415
16414
1279
14934
3732
8434
2189
13196
22059
4618
4976
1393
6104
3397
4655
5912
22967
4365
7862
13825
12652
22734
9561
11151
10008
11315
5798
15700
4142
2206
3222
10655
9602
10710
4798
4799
10070
2763
18983
7334
5813
19769
12504
8589
2484
26751
13430
8562
1064
7507
10969
12120
15928
7300
3380
10144
13553
8155
7540
5904
20476
7237
9559
15074
1721
4989
7890
24439
6125
2848
9502
18595
8618
8848
3283
5494
27992
10642
8523
7644
2498
5638
2740
11517
11092
14472
10439
5139
6712
14199
3753
2916
3411
15328
9290
3600
9349
1375
7325
8563
24032
15361
10695
4195
2321
3636
10247
1486
15069
9143
8016
19588
17036
3802
7490
2792
2793
13490
1281
15721
4402
4121
4152
21015
4674
26560
3365
3185
5935
17161
11136
8540
21427
17160
7868
11962
11765
11766
8082
23486
4559
4794
6251
15517
6655
12181
10668
4339
10329
24613
2157
8881
3417
25956
5008
13591
10712
9151
18943
5226
5918
9043
27753
17212
3569
3570
4179
9721
8049
3347
6651
10382
8832
23055
29271
12665
19014
2515
3593
908
12465
5041
25617
7478
10141
7762
9598
13133
11849
8900
6529
10500
7759
8790
2287
15915
4725
16705
5374
5186
4836
23018
20342
13403
6564
9300
12071
10708
7299
1598
10130
7971
3876
6778
4518
14109
6480
5216
1988
3370
25902
23810
26499
7872
15504
2638
10520
6854
9112
5748
1750
14445
14153
14047
4424
25841
7693
10925
4368
8102
17226
16846
4005
6591
23598
12501
6080
5154
5155
2593
11952
10184
18766
9751
3279
7838
23558
3039
8125
3067
12482
11468
2722
13176
6496
8173
7942
10703
20120
700
8627
3486
7749
16980
4077
490
1631
8595
11746
496
3455
14559
5598
3709
10093
10094
20235
29578
5972
16689
23684
16066
13129
1713
9676
8144
4691
13010
3490
13935
3280
5790
2291
5926
6048
15557
16422
16421
9509
2233
5620
5925
24813
7026
20468
4395
6325
6326
3213
3214
4770
1629
1152
10485
16466
3594
7181
9019
5807
9977
18740
12388
8303
10871
15229
6551
4843
5380
3983
15810
7827
8826
17453
7957
11950
15395
1838
3628
13256
5416
3107
11063
778
4132
7678
14901
11056
16120
8222
6723
16455
7848
2004
5732
8478
9640
19825
1169
15085
13744
4056
9933
4233
7110
2345
12654
28346
10975
4821
14806
20119
21482
6574
4911
14722
12845
9584
4519
8224
21846
24569
3530
13892
13511
16138
13682
7811
7010
1746
11928
28073
5228
23431
10700
10943
6142
12892
21202
19918
24877
15981
10375
4652
7888
7454
11246
16404
22303
6570
6571
3457
3521
6031
4881
4279
5938
12797
4016
7102
3972
5694
5465
14340
11204
21778
4692
14367
7527
1392
11355
6719
11031
7535
14330
13369
6576
10103
11602
2446
2036
1821
5113
8665
22353
7555
17545
1056
11030
14454
5546
5744
8781
5664
9079
11745
11692
1344
11539
7471
5597
22671
20960
6600
6502
16539
4482
7459
8543
4739
16279
3590
9520
16258
5875
17839
13227
11855
7353
9473
17166
16379
13278
9529
1413
4645
6767
17401
29170
5658
9971
1494
1112
18566
6749
8457
10286
18751
10626
15661
6929
7502
2372
14876
7613
6599
748
3908
2708
4818
2252
4221
18349
6005
4266
4103
11981
2929
13712
3206
24042
3137
20146
7878
18343
6255
12508
1818
20065
12361
3507
4086
2970
14111
19962
3767
13508
3372
1015
143
2525
5356
15736
3241
7363
10246
1082
14183
6058
7782
18651
4474
15319
3219
4938
14067
13047
2788
2925
7997
8470
13902
1980
3085
18298
2917
3166
9876
21951
2180
2966
17037
1371
12090
11349
12009
21282
5391
17283
20241
22438
9238
15393
9374
763
25855
2024
16593
9738
11811
3485
3500
3258
5733
15741
14938
11560
9783
23000
26430
14389
2359
6221
5901
2634
14705
13144
8872
3992
19276
17476
2329
6102
2827
7317
12772
3412
4720
9958
3122
7344
10796
4258
11487
16540
6464
9796
17760
26444
3088
9478
10923
14078
4489
2653
8432
24865
19910
22335
932
8118
6594
9988
13893
1524
3523
10899
5891
3233
10063
7011
15756
11081
5208
2382
10587
12853
14225
6342
5290
6243
4383
7292
7405
8315
5831
5833
10134
25197
18397
18293
4840
210
22323
4922
6043
5199
8475
23409
11767
11768
3626
2468
24406
5028
18517
9313
6311
10930
8635
4702
13674
3366
27797
8535
5220
6018
4729
10408
430
8467
17346
2649
13755
6274
11507
4202
14725
29160
10171
13719
8828
9774
28728
9739
5431
2971
12099
13239
7008
15166
892
12512
1831
3218
12052
1587
6130
7226
3913
7618
17830
27967
10477
16661
13982
12154
12464
4388
28920
14584
5646
6762
24521
544
4465
5944
11284
1738
15692
7314
2416
1030
9183
17810
15164
6510
733
2978
22301
8711
7251
25540
5663
6674
7925
4978
27993
4678
5862
12650
23270
12053
16752
10186
11114
3928
13307
5705
13153
12283
8444
24872
4470
6605
10096
3656
15590
7046
27881
5389
28838
10225
13422
3547
515
5856
7830
2632
7591
4670
6285
6286
363
4462
11469
16824
6872
4276
16236
4575
1073
18728
8569
9256
18856
4481
4996
11905
3671
8194
20293
17274
7034
3145
24297
13955
19245
7318
1291
6761
10639
28573
26411
20535
12058
7441
12825
26854
5251
7289
15953
13112
13113
13114
5789
2297
16004
5060
4558
4101
1356
1357
15966
13284
8023
9169
10298
1736
5583
10296
18714
9439
2545
303
4451
3430
7596
12068
23913
2031
12204
404
13668
2721
3699
6041
4956
15669
7794
22389
4009
3199
9220
20879
2887
12147
17506
3574
8163
7551
10599
22649
6140
11342
11630
12513
14620
8257
3836
6956
14939
9465
4905
13401
2379
24110
13608
9065
13783
2847
6624
11913
1879
3872
5556
7402
16423
22784
18970
10490
7939
5541
7571
12162
10235
1708
6555
15911
18341
1964
12932
16134
1850
167
22931
9923
9092
4796
7078
15040
3980
13235
25458
22625
9150
13847
8910
10525
19246
2078
4707
8469
7188
21820
20898
8606
4013
3028
3029
18647
15696
15697
9075
27052
3866
7704
1670
22592
7612
15982
22836
22837
5296
12962
11339
11382
17286
17930
18425
15127
1571
19263
23324
4779
15910
5679
10646
23439
2592
4138
7079
8371
14919
5786
13485
7622
7623
3114
1000
4509
9909
637
4196
7561
12866
20068
17918
5547
6685
12183
18320
10460
10560
5256
14308
12555
14309
7760
15187
16322
15276
4225
2104
6627
5588
6710
17818
6114
21989
27072
4914
3977
22613
18488
10574
244
19439
9053
7523
4433
4434
12949
9441
11989
23102
2236
10823
11582
16381
22964
6178
10054
6270
10647
17178
4540
7223
9144
1199
13321
15686
12078
1778
1779
3995
9623
7753
4813
6848
15478
12713
3295
8994
8006
23323
15502
17711
8383
3091
15137
8363
8251
4658
5410
16255
20326
6575
7932
17385
13441
4347
10314
11603
15527
10135
9929
8085
6688
18152
21600
20175
6562
11042
7912
17910
19113
7246
17997
12749
3234
5188
17739
9446
3337
4824
11612
26163
12088
17547
5701
14611
13842
2265
12390
5404
11548
27331
15940
11549
13057
13058
18732
24133
10538
5144
6950
8265
6974
13068
3842
4293
25602
17321
23110
23111
4062
11902
5021
2709
21351
15477
19297
7090
4472
6416
7594
6775
12729
11220
15231
27118
4547
12405
6169
23377
24831
13710
6803
23331
3493
6407
7263
7537
2910
152
19023
11679
6396
6807
19564
8516
26123
20719
2923
9113
14554
6367
9663
2220
13110
7933
2486
8774
13115
7498
14370
15373
20670
10517
22023
4700
18056
8348
6596
12145
23578
13358
5711
1552
14836
8354
4901
7232
18581
26588
13503
8521
5835
21725
15135
12346
2843
5252
6614
5876
6523
10041
17772
4651
25079
8110
7534
5530
8440
19247
15281
10801
22899
5717
3231
6128
11214
2145
9415
12217
14466
3549
10025
6358
9827
7958
6965
9651
18176
6197
8702
10012
12981
1261
1262
2057
24669
24668
14071
12854
4862
18992
2371
14963
10466
15178
7301
1843
1767
3294
4094
4764
27044
25851
10192
10193
7271
15081
3298
3416
8428
2701
8416
13298
3881
13175
11086
7111
5308
20325
10454
26426
16716
16717
9622
6328
18961
9755
1427
3156
16903
4285
25660
4090
5993
17925
12141
24781
8410
14875
16076
8755
17866
5648
17122
29819
8602
25535
10954
5947
3127
12964
13797
3098
11735
5871
2993
4588
8004
2900
3266
27574
21996
8171
11130
5869
21002
5678
4263
8379
8380
2196
31620
7360
11248
8404
1372
22834
17330
14249
8957
9646
4745
7828
24213
18696
5370
9190
17282
3031
5303
23900
6113
25925
5001
2296
13140
25297
7605
13445
8482
1595
7448
26975
13913
15539
16966
25896
16919
23396
7557
20184
7242
4024
8424
11125
20764
13012
15067
4051
8519
28324
7025
4264
13943
3471
6789
9691
7453
10946
4534
10882
5424
7927
15476
5812
11614
26313
15712
8408
11166
3739
19926
7279
24663
14731
8906
15972
23278
11705
14659
19269
4677
13637
8293
5127
6155
6156
10348
10556
18789
16206
3808
5111
30613
5258
2875
8800
27883
13220
14512
14869
9182
9647
8411
9109
8143
7122
7092
6312
4646
6831
5129
14012
15225
13204
9153
5136
17070
8557
11933
7583
22813
22939
11200
13738
17589
10067
4767
5275
6215
6216
12399
15781
25868
25869
15783
18564
2703
11919
5010
19623
22236
7737
6144
7898
10107
7797
26246
16161
11046
11047
12944
17220
13529
10504
9859
6708
14513
27013
29517
6244
11107
8961
7751
2552
13542
11104
5134
16619
8366
2238
13594
15300
2523
15176
9501
15964
23132
13049
11712
11518
2140
15792
10347
8042
14096
9736
5537
8827
13947
16305
13897
10254
8976
5425
14639
25447
10484
10387
4668
5950
3630
7831
17740
61
1695
3942
14670
4724
4310
1991
2582
3504
18468
8584
3212
2167
4126
4127
17426
25035
15106
5428
7934
14591
1318
1910
2982
18500
10453
11387
20658
1558
3550
8652
9703
9704
9701
2015
22216
4022
3324
10938
22805
24378
24379
11856
14745
2279
1865
16954
20983
13180
15930
11554
2492
5377
5524
10369
7367
7368
8316
3694
8061
15332
8677
12531
25998
11707
12197
6152
4461
3572
18137
13936
4303
1301
4449
22330
16433
6522
5322
4776
19180
8418
8756
7147
13706
10793
4895
4257
6673
4903
8643
13109
21540
2730
9388
5187
8479
4376
9199
16852
1823
4038
7270
4533
6756
16765
3945
14889
4860
22574
8950
8951
12389
12562
17966
8638
7265
2440
23967
12136
8760
8294
3344
22767
27094
3330
11784
9512
26696
26697
12150
5006
4354
13004
16215
10237
21787
15828
5447
8072
18720
10808
16056
18673
12590
27401
6745
23743
14427
8783
7703
5411
18433
6922
16959
16926
12603
21340
13097
26178
2635
22277
3058
3941
12755
5721
8233
9954
6075
9408
22580
19381
9899
11187
15506
26385
13964
7702
7395
5328
24351
22726
13357
8703
5234
3812
10499
5030
13916
4844
15000
18155
8547
12403
12404
5982
12783
5523
26099
5319
9656
8283
3786
8932
21648
6083
6099
6150
13925
3975
12139
10022
6813
11687
29874
7182
13534
2623
3388
3469
15665
13504
7399
4336
12107
4329
8657
8252
3696
17549
1010
6098
6865
13426
9471
18311
2362
8321
15099
4985
6258
12915
3033
6957
16927
20651
15419
5265
774
17831
2812
12179
11797
6781
13785
5534
4765
11697
7029
16451
27148
14217
14817
7965
7023
14606
15286
18482
12649
11321
8423
13927
5975
17763
13351
28147
25908
9009
5821
5822
4581
29812
14944
11755
11756
13484
4896
6394
6087
3187
6721
25642
2276
18077
12157
570
7225
4576
4577
16855
7374
10388
22619
23710
5298
1742
10492
28125
17001
18780
18781
13831
8270
18772
25913
27953
22441
25026
20137
3356
16521
5273
15101
15102
4242
7756
3436
7157
7606
24453
4869
585
13245
19423
9535
9240
20475
20531
7075
17621
9228
4706
10215
2948
19273
9093
7514
5490
3261
5020
17773
9357
15574
14446
10731
13344
23972
14194
17811
27750
10595
10669
7556
6133
12084
994
8586
9449
11587
11747
8731
6108
12395
21794
12830
7521
6904
10085
10748
15524
257
4379
4228
8087
13666
14044
13191
5951
4695
17395
7081
18995
21511
25369
2955
4259
4897
1968
26636
8813
6661
5440
6175
3599
16339
6757
6694
11474
10894
7889
21957
18661
12428
11318
13011
27129
7684
8103
5685
14833
10261
5398
2654
20435
3624
14388
19510
7607
17946
4030
8608
11878
13105
9434
5224
9428
11019
28261
24394
12232
13301
5838
7656
10919
14100
5662
2997
2537
4407
3843
20375
18295
11463
13798
1700
10653
16183
5923
25954
13287
8619
17633
10125
7841
6866
17792
9469
5172
17225
18033
23581
10251
18262
17512
7528
17337
7726
7727
3164
12757
12758
6935
9447
10737
12622
8160
5906
16632
22888
20538
8109
4802
18497
3179
17495
2837
902
18036
6217
22207
20603
25587
3683
11199
9804
1258
26948
5989
10799
22404
22124
10775
15096
11598
23381
8174
3566
6338
16461
16462
16463
15254
7273
15030
18737
6994
5383
20451
12329
16489
5109
12571
11060
24556
22882
10519
1983
1984
12426
14030
9398
12339
25856
14094
18874
31333
4735
7132
8916
24761
14459
8438
7763
5979
17222
1917
20668
5320
2723
6179
10550
18075
24736
23423
24737
24841
11292
6376
10498
9492
18171
17518
16895
16896
2665
3557
6295
9851
14449
11844
12604
5306
13934
11840
12903
18582
3048
6054
717
28279
8936
4286
8691
12951
14049
9407
7845
7240
22756
6422
5004
1908
6444
3121
14387
6145
6908
4825
5614
14263
1611
7796
16753
1483
10212
20620
3429
8980
10118
2694
10656
18977
10682
10707
15149
26088
11189
11700
11701
2802
7435
13543
13544
15727
8996
4023
23979
24646
12994
10064
20909
14518
7162
827
8153
7340
6365
6366
6626
24824
16675
27581
12126
16021
14240
3006
18799
2733
19424
6248
11938
10661
11210
16727
2587
20758
8729
18665
9752
9753
13339
15722
11404
10696
5152
26827
16800
20200
4809
19268
7093
3560
7765
5538
20494
8825
9515
5703
8035
10327
27442
6327
8454
22824
10407
17224
14943
9489
6278
18705
7458
7787
11451
21225
18953
8925
8926
16991
5151
6204
23128
15020
6516
16041
3408
16016
14095
20424
3901
10430
11164
11917
18792
13996
5159
9394
14855
6653
5724
1601
23050
16691
3684
15863
10230
16964
32815
16986
1179
19773
8168
6841
5814
8388
26062
18594
10559
7264
24414
2062
6341
13236
4504
17782
7252
9245
5376
16014
4076
13638
11196
16949
10458
10264
8172
16240
13533
9563
3488
10167
5730
17525
21099
22835
23639
12341
18264
3223
10467
5333
13730
25689
14578
3262
5248
9257
22076
3456
15104
11741
5051
1921
27243
18825
11320
7816
14601
2862
8710
23824
2465
3400
13649
7158
10739
9114
28999
7244
7455
17452
14881
1589
5866
20274
14204
5820
17264
9095
16128
14728
14729
14927
9794
14994
9568
4492
23571
10554
10428
2752
16263
25332
10751
16714
7513
4698
10129
6909
5640
3461
4875
6660
9125
7473
12579
13774
1836
1837
11369
4069
10541
3038
5515
22063
1882
17746
4684
1298
15738
19277
7822
4784
3794
23378
3762
3509
15843
3395
9251
8717
13519
8419
11100
3017
17747
6610
9715
6632
17971
7396
12683
3752
1961
6509
1863
21602
2669
3742
19876
11653
20186
7662
9639
3472
8262
8794
17550
7266
7411
6188
9758
1630
22228
20059
2817
14957
6954
9889
14664
13123
16670
2141
18999
19190
16499
16320
17560
10618
8460
3821
7658
10721
4671
7028
2650
5286
6504
10285
11141
19734
26145
5791
2207
6941
4404
18643
18464
12079
3703
3704
28560
28451
14467
16816
11536
1531
15879
5217
5828
20433
8500
10316
8029
12561
183
7419
9612
987
18455
5082
26187
13252
16159
8675
6200
10279
17176
10588
30232
19937
4436
6460
6146
9934
17623
10883
23495
12336
16505
16827
2087
10201
12718
9678
4212
18147
5968
1406
4637
1083
8091
19409
4662
8468
8495
25488
17630
23906
10600
13923
5548
9558
1580
1898
4748
9684
4466
13863
21048
12673
23163
11384
12499
8246
15344
3198
5390
17378
2184
5292
17211
4102
19200
5526
22260
7897
24418
3200
17141
12352
10052
2500
3259
6732
22018
18891
13237
13650
2480
14770
5421
2249
24874
9560
10979
10838
16594
16832
13361
18466
10841
26971
23862
2088
13969
23279
16074
10960
7573
5661
3076
834
14545
13462
14669
1922
1727
15118
10809
8795
3640
13819
13671
13940
11545
6051
6945
3349
2493
9448
13126
11007
6316
13251
11731
23011
4287
6863
14805
14727
11391
8182
6748
29115
14334
18400
18776
10811
1565
18352
5347
10218
1579
1952
10128
14587
22168
8505
5288
11156
6032
22174
22687
10059
8787
8341
14979
6279
6469
207
17266
4696
24016
2258
10780
16500
15508
10755
5734
5788
16595
14682
10032
19345
7319
5603
17086
3336
3396
4973
8820
16048
10372
9320
2510
5942
3399
24162
5943
28388
28389
15355
12121
4151
9595
8120
6844
13711
8005
8083
9522
11817
7632
9839
16531
7287
11065
18133
3002
2579
14402
9470
3216
11425
7436
1827
12576
13787
10166
6668
4548
746
25752
6664
15296
8693
1481
6648
15893
6158
8845
12391
23579
22252
4690
6061
28055
9352
13673
13037
22294
3573
15681
9967
13740
8450
8376
15947
5760
20994
14302
10324
8942
8943
8944
5067
10109
1122
6049
13972
25108
17323
15548
16701
18166
9368
14107
14328
10511
12330
3235
23329
8726
11909
10806
18538
5462
29319
3090
23010
9218
13436
10813
7295
24791
5630
5163
11869
6931
15160
23659
11752
15214
5063
4059
12764
9405
8234
9942
3728
4701
10414
10003
23300
12880
7955
7249
9797
25253
6135
21343
9648
18688
18524
4367
9102
26870
9616
11912
4168
9333
5314
13952
695
696
17171
14079
1689
10617
7529
2956
11158
11864
5161
5487
7747
14051
7855
4755
13442
14622
1171
7031
26003
5488
15767
22003
184
22248
23259
6671
982
3587
7812
10939
3857
6949
10893
13587
16612
7356
7621
12984
14807
14481
10336
3528
15338
12974
21207
407
10083
29695
8603
8692
2815
17590
1327
22928
3542
27794
23877
11660
13417
23748
4133
5130
5316
19933
26525
13073
11419
3163
15298
13987
4712
11330
26347
23198
2133
24996
5736
11291
4488
2428
6672
2231
27584
21183
26001
7339
6257
23159
1809
1810
25440
6850
1044
24427
8938
3328
12447
10580
12417
11201
2218
8727
11068
9976
14288
11159
1418
12200
13748
8193
12031
16728
3825
4797
4248
7616
18138
4943
13241
7572
492
7899
6056
16387
15836
10584
13600
9610
27276
11698
5413
10632
20316
26518
16107
7978
8399
24217
6892
19989
10335
4250
768
15428
3326
21611
4498
5802
6190
11646
7298
12628
14730
16553
1399
6699
2072
8989
8990
8296
5014
16970
11621
17164
3404
23765
15342
8546
25595
23584
6629
11816
23233
4659
7602
26675
9479
9675
18736
7048
12344
28274
2364
6684
6797
2068
24945
5435
9384
5007
6361
11193
2310
6497
22262
20721
4507
9959
11822
15841
20745
6252
8601
9250
9020
22818
25611
15437
5939
5239
11311
17859
17005
5686
15909
10037
2264
7918
6590
21804
9280
14687
14977
23825
7463
13655
14447
7597
5962
6959
26985
12410
10066
10361
8232
6494
23932
11540
27342
6339
8332
4708
17622
11903
6804
5863
23769
20039
6830
343
7194
9500
5994
3621
3111
23513
3855
9773
13007
11882
10142
10143
10145
15786
10061
8309
17712
19971
5610
19618
11297
17304
9962
22235
23039
24629
9884
12873
4170
2874
2637
10547
6333
8372
8401
22198
31718
23038
25307
30525
5461
3673
16492
12463
13377
9028
2378
18472
18162
714
18783
26043
28635
9309
2951
2953
13074
28498
27855
4683
21521
26739
11924
6410
22086
17605
13920
15979
10337
7357
10968
8894
7798
11678
15222
4333
13580
13571
14136
25755
8684
24677
11252
10874
8964
26931
7378
5046
6193
6194
10918
4217
10464
6777
16526
19508
24920
15197
8095
6794
11149
27720
13219
22757
17727
10401
6793
8471
26034
27406
9422
14462
8466
3414
4072
7638
3165
27616
7296
7694
18192
18303
5039
12034
9897
24118
21812
8308
25144
5617
23694
15800
3415
9983
3227
15002
13662
12675
16277
13690
3933
3934
24262
9160
6870
10914
7200
10916
10917
11038
5899
12273
21591
3730
18925
7177
2426
22550
8235
6400
15668
22536
16631
9386
13055
8007
8792
14599
4311
6579
16943
17717
13069
12041
23927
17256
10927
9737
12491
4306
1930
7913
6238
22231
6433
4112
20207
21415
18330
19357
5246
6352
6353
10311
11205
26911
703
9802
12385
6851
13143
7584
15760
30323
17170
13801
8405
4998
20436
12221
10328
12348
9979
13879
6586
7018
9642
15202
14037
26839
26837
28530
26838
6917
697
4639
5924
9779
3810
4747
11024
6899
12153
11773
20102
8230
2277
23468
2012
28347
11256
14890
25059
16243
13189
16079
10886
13340
6750
7493
7098
13832
9336
13526
15984
19456
24579
28870
3609
16920
3907
7969
7479
5387
26433
8953
17185
13891
12792
12032
16409
14287
10405
5315
21952
12820
13551
16745
16776
4820
3167
15221
15834
8735
22022
3998
14190
13483
18174
18240
6876
29835
2922
2325
29753
6888
5650
12536
4243
8349
22630
25871
10843
18279
30505
8169
13843
15941
2717
125
13285
24393
15318
5165
14837
27239
1441
26758
11448
9312
5476
16257
2259
3665
4786
27567
14055
14056
4125
20631
8935
6520
8347
15663
3531
13330
15888
7172
11728
11185
8941
8548
22379
26937
11197
11198
12476
11005
25052
8689
10683
10686
5351
5353
22474
6095
19047
2388
10363
15591
25852
15139
6457
17861
7239
3875
11717
8512
4490
14186
16130
756
23427
6942
28295
19886
10379
18605
20116
12244
5078
23333
10610
9762
4768
8587
16591
16929
28087
8422
16756
4529
5595
19481
17261
9180
2890
8053
6628
6947
22445
7277
12639
21122
8880
15436
4156
9278
21729
13820
3392
9195
3664
24695
24654
28303
22998
18165
23387
4107
13717
22201
14360
14361
22930
15782
7144
9498
8024
12245
13721
25709
28656
8261
6491
17884
19725
3595
9585
12969
12558
18576
11423
8545
17541
26970
22025
26417
18259
12672
17737
26141
8385
26025
3522
23554
2977
9285
11515
12636
10542
12754
5108
6013
14517
7483
14179
11736
24067
15874
8503
18958
19762
11940
6816
12885
2907
26210
26297
16444
3487
15652
19350
17373
14742
8159
3700
26654
20152
843
5027
8697
14189
16046
10170
30648
9658
1733
8221
5056
9672
22273
8497
12924
2228
11140
18822
13468
25861
14888
15833
12229
4605
2385
5793
16654
22712
6241
4029
9840
9938
9939
6223
8508
3773
26685
13905
17203
6873
12201
4480
3629
19087
12843
25994
15341
14278
8893
14206
24182
6147
1165
21424
1608
7687
4616
19171
8499
11908
13804
20032
17570
10944
27067
4147
16454
18408
21137
10075
24645
20996
4463
6136
13995
11286
5213
5214
11113
25091
5826
17454
4591
10015
9700
2103
11820
6302
16300
19878
13146
17573
13625
1737
12323
8984
10577
1673
11447
1807
7003
6692
22274
11268
20051
4392
16319
22476
5054
14393
5888
16256
5815
9330
25937
6948
15325
12299
5907
9714
13695
23463
11656
16063
5580
16660
2058
23553
25356
10400
9905
12384
11406
14985
13381
7988
22080
346
11183
3035
7214
25699
11776
8415
13623
13624
7293
18615
15897
14650
16431
13203
24710
24711
24099
